benchmark/evidencias/esc01_carga_minima.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /
HTTP Method:            GET

Concurrency Level:      1
Time taken for tests:   0.243 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      0
Total transferred:      5200 bytes
Requests per second:    412.32 [#/sec] (mean)
Time per request:       1.29 [ms] (mean)
Time per request:       1.29 [ms] (mean, across all concurrent requests)
Transfer rate:          20.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        1   1        1    3

Percentage of the requests served within a certain time (ms)
  50%   1
  66%   1
  75%   1
  80%   2
  90%   2
  95%   2
  98%   2
  99%   2
 100%   3 (longest request)

--- Resumen del escenario ---
Escenario:   1. Carga minima
Descripcion: 1 usuario realiza solicitudes GET al endpoint principal. Linea base.
Endpoint:    GET /
Notas:       Linea base: latencia minima sin contencion.