benchmark/evidencias/esc02_carga_normal.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /
HTTP Method:            GET

Concurrency Level:      10
Time taken for tests:   30.127 seconds
Complete requests:      21032
Failed requests:        0
Non-2xx responses:      0
Total transferred:      1093664 bytes
Requests per second:    698.1 [#/sec] (mean)
Time per request:       14.26 [ms] (mean)
Time per request:       1.426 [ms] (mean, across all concurrent requests)
Transfer rate:          35.45 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        6   14        9    958

Percentage of the requests served within a certain time (ms)
  50%   9
  66%   14
  75%   14
  80%   19
  90%   19
  95%   36
  98%   94
  99%   94
 100%   958 (longest request)

--- Resumen del escenario ---
Escenario:   2. Carga normal
Descripcion: 10 usuarios concurrentes acceden a la pagina de inicio durante 30s.
Endpoint:    GET /
Notas:       Simula trafico cotidiano sobre el endpoint raiz.