benchmark/evidencias/esc03_carga_moderada.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/mecanicos
HTTP Method:            GET

Concurrency Level:      50
Time taken for tests:   60.27 seconds
Complete requests:      13687
Failed requests:        0
Non-2xx responses:      0
Total transferred:      20311508 bytes
Requests per second:    227.1 [#/sec] (mean)
Time per request:       219.43 [ms] (mean)
Time per request:       4.389 [ms] (mean, across all concurrent requests)
Transfer rate:          329.11 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        23   219        142    2619

Percentage of the requests served within a certain time (ms)
  50%   142
  66%   324
  75%   324
  80%   506
  90%   506
  95%   668
  98%   1068
  99%   1068
 100%   2619 (longest request)

--- Resumen del escenario ---
Escenario:   3. Carga moderada
Descripcion: 50 usuarios concurrentes en el listado de mecanicos. Duracion 60s.
Endpoint:    GET /api/mecanicos
Notas:       Endpoint de listado/busqueda con datos reales.