benchmark/evidencias/esc05_autenticacion_masiva.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/auth/login
HTTP Method:            POST

Concurrency Level:      30
Time taken for tests:   30.506 seconds
Complete requests:      1352
Failed requests:        0
Non-2xx responses:      0
Total transferred:      566488 bytes
Requests per second:    44.32 [#/sec] (mean)
Time per request:       670.26 [ms] (mean)
Time per request:       22.342 [ms] (mean, across all concurrent requests)
Transfer rate:          18.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        384   670        669    825

Percentage of the requests served within a certain time (ms)
  50%   669
  66%   702
  75%   702
  80%   734
  90%   734
  95%   747
  98%   773
  99%   773
 100%   825 (longest request)

--- Resumen del escenario ---
Escenario:   5. Autenticacion masiva
Descripcion: 30 usuarios concurrentes enviando POST a /api/auth/login.
Endpoint:    POST /api/auth/login
Notas:       Mide costo del hashing bcrypt y emision de JWT.