benchmark/evidencias/esc06_consulta_a_base_de_datos.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/citas/ocupadas/7?fecha=2026-06-09
HTTP Method:            GET

Concurrency Level:      20
Time taken for tests:   30.184 seconds
Complete requests:      11339
Failed requests:        0
Non-2xx responses:      0
Total transferred:      634984 bytes
Requests per second:    375.66 [#/sec] (mean)
Time per request:       52.94 [ms] (mean)
Time per request:       2.647 [ms] (mean, across all concurrent requests)
Transfer rate:          20.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        12   53        22    667

Percentage of the requests served within a certain time (ms)
  50%   22
  66%   77
  75%   77
  80%   132
  90%   132
  95%   181
  98%   287
  99%   287
 100%   667 (longest request)

--- Resumen del escenario ---
Escenario:   6. Consulta a base de datos
Descripcion: 20 usuarios concurrentes en endpoint con busqueda filtrada.
Endpoint:    GET /api/citas/ocupadas/7?fecha=2026-06-09
Notas:       Filtro por mecanico_id, fecha y estado (3 indices SQL).