benchmark/evidencias/esc07_creacion_de_recursos.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/citas
HTTP Method:            POST

Concurrency Level:      15
Time taken for tests:   0.939 seconds
Complete requests:      150
Failed requests:        0
Non-2xx responses:      0
Total transferred:      56292 bytes
Requests per second:    159.73 [#/sec] (mean)
Time per request:       77.77 [ms] (mean)
Time per request:       5.185 [ms] (mean, across all concurrent requests)
Transfer rate:          58.54 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        17   78        76    130

Percentage of the requests served within a certain time (ms)
  50%   76
  66%   88
  75%   88
  80%   100
  90%   100
  95%   111
  98%   125
  99%   125
 100%   130 (longest request)

--- Resumen del escenario ---
Escenario:   7. Creacion de recursos
Descripcion: 15 usuarios concurrentes enviando POST para crear citas.
Endpoint:    POST /api/citas
Notas:       Escritura concurrente en tabla citas (con INSERT y FK).