benchmark/evidencias/esc08_carga_sostenida.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/servicios/categorias
HTTP Method:            GET

Concurrency Level:      25
Time taken for tests:   300.177 seconds
Complete requests:      111451
Failed requests:        0
Non-2xx responses:      0
Total transferred:      14711532 bytes
Requests per second:    371.28 [#/sec] (mean)
Time per request:       67.3 [ms] (mean)
Time per request:       2.692 [ms] (mean, across all concurrent requests)
Transfer rate:          47.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        10   67        39    1772

Percentage of the requests served within a certain time (ms)
  50%   39
  66%   96
  75%   96
  80%   154
  90%   154
  95%   212
  98%   389
  99%   389
 100%   1772 (longest request)

--- Resumen del escenario ---
Escenario:   8. Carga sostenida
Descripcion: 25 usuarios durante 5 minutos continuos.
Endpoint:    GET /api/servicios/categorias
Notas:       Detecta degradacion progresiva: memory leaks, pool de conexiones.