benchmark/evidencias/esc09_endpoint_rest_json.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/mecanicos
HTTP Method:            GET

Concurrency Level:      40
Time taken for tests:   30.269 seconds
Complete requests:      7140
Failed requests:        0
Non-2xx responses:      0
Total transferred:      10595760 bytes
Requests per second:    235.88 [#/sec] (mean)
Time per request:       168.45 [ms] (mean)
Time per request:       4.211 [ms] (mean, across all concurrent requests)
Transfer rate:          341.84 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        19   168        103    2136

Percentage of the requests served within a certain time (ms)
  50%   103
  66%   250
  75%   250
  80%   396
  90%   396
  95%   536
  98%   902
  99%   902
 100%   2136 (longest request)

--- Resumen del escenario ---
Escenario:   9. Endpoint REST JSON
Descripcion: 40 usuarios concurrentes consumiendo endpoint JSON.
Endpoint:    GET /api/mecanicos
Notas:       Mide latencia y throughput de respuesta JSON serializada.