benchmark/evidencias/esc10_flujo_completo.txt
This is ApacheBench-compatible report generated by MecanicGo benchmark runner.
Benchmarking 127.0.0.1 (be patient)

Server Software:        uvicorn
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/auth/login
HTTP Method:            POST

Concurrency Level:      20
Time taken for tests:   2.402 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      0
Total transferred:      41900 bytes
Requests per second:    41.62 [#/sec] (mean)
Time per request:       427.04 [ms] (mean)
Time per request:       21.352 [ms] (mean, across all concurrent requests)
Transfer rate:          17.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Total:        240   427        442    641

Percentage of the requests served within a certain time (ms)
  50%   442
  66%   480
  75%   480
  80%   518
  90%   518
  95%   576
  98%   632
  99%   632
 100%   641 (longest request)

--- Resumen del escenario ---
Escenario:   10. Flujo completo
Descripcion: 20 usuarios simulan login -> consulta -> creacion -> logout.
Endpoint:    POST /api/auth/login
Notas:       Paso 1 del flujo end-to-end (login). Las siguientes etapas se miden via los escenarios 6 (consulta), 7 (creacion) y la invalidacion del token en cliente (logout sin estado en backend).